In [2]:
import pandas as pd
ser1 = pd.Series([0,1,1,2], index=['v','y','z','x'])
ser1

v    0
y    1
z    1
x    2
dtype: int64

In [3]:
ser2 = ser1.reindex(['u','v','x','y','z'])
ser2

u    NaN
v    0.0
x    2.0
y    1.0
z    1.0
dtype: float64

In [4]:
ser3 = pd.Series(ser2.values)
ser4 = ser3.reindex(range(7), method='ffill')
ser4

0    NaN
1    0.0
2    2.0
3    1.0
4    1.0
5    1.0
6    1.0
dtype: float64

In [5]:
ser5 = ser4.drop(4)
ser6 = ser4.drop([4,5])
ser4, ser5, ser6

(0    NaN
 1    0.0
 2    2.0
 3    1.0
 4    1.0
 5    1.0
 6    1.0
 dtype: float64,
 0    NaN
 1    0.0
 2    2.0
 3    1.0
 5    1.0
 6    1.0
 dtype: float64,
 0    NaN
 1    0.0
 2    2.0
 3    1.0
 6    1.0
 dtype: float64)

In [6]:
df = pd.DataFrame({1:[1,2,3], 2:[10,10,20]})
df

   1   2
0  1  10
1  2  10
2  3  20

In [7]:
df.drop(1, axis='columns')

    2
0  10
1  10
2  20

In [8]:
df.drop([1,2], axis='columns')

Empty DataFrame
Columns: []
Index: [0, 1, 2]

In [9]:
df, df.drop(1, axis='columns'), df.drop([1,2], axis='columns')

(   1   2
 0  1  10
 1  2  10
 2  3  20,
     2
 0  10
 1  10
 2  20,
 Empty DataFrame
 Columns: []
 Index: [0, 1, 2])

In [10]:
df[2]

0    10
1    10
2    20
Name: 2, dtype: int64

In [11]:
df[:2]

   1   2
0  1  10
1  2  10

In [12]:
df < 10

      1      2
0  True  False
1  True  False
2  True  False

In [13]:
df1 = df.copy()
df1[df >= 10] = 0
df1, df

(   1  2
 0  1  0
 1  2  0
 2  3  0,
    1   2
 0  1  10
 1  2  10
 2  3  20)

In [14]:
import numpy as np

df3 = pd.DataFrame(
    np.random.randn(3,3),
    columns=['alfa','beta','gamma'],
    index=['a','b','c']
)
df3, df3.loc[['c','a'], ['beta','alfa']], df3.loc[['c','a'], 'gamma'], df3.loc['c']

(       alfa      beta     gamma
 a -2.139268 -0.607877 -0.781128
 b  0.655991 -0.112096  0.723926
 c -0.438837  0.233874  0.915099,
        beta      alfa
 c  0.233874 -0.438837
 a -0.607877 -2.139268,
 c    0.915099
 a   -0.781128
 Name: gamma, dtype: float64,
 alfa    -0.438837
 beta     0.233874
 gamma    0.915099
 Name: c, dtype: float64)

In [15]:
df3

       alfa      beta     gamma
a -2.139268 -0.607877 -0.781128
b  0.655991 -0.112096  0.723926
c -0.438837  0.233874  0.915099

In [18]:
df3.loc[['c','a'], ['beta','alfa']]

       beta      alfa
c  0.233874 -0.438837
a -0.607877 -2.139268

In [19]:
df3.loc[['c','a'], 'gamma']

c    0.915099
a   -0.781128
Name: gamma, dtype: float64

In [20]:
df3.loc['c']

alfa    -0.438837
beta     0.233874
gamma    0.915099
Name: c, dtype: float64

In [21]:
df3.iloc[1:2]

       alfa      beta     gamma
b  0.655991 -0.112096  0.723926

In [23]:
df3.iloc[:,2][df3.alfa>0.5]

b    0.723926
Name: gamma, dtype: float64

In [24]:
df3.at['b','gamma'], df3.iat[1,2]

(0.723926351344976, 0.723926351344976)

In [27]:
df3.iat[0,0], df3.at['a','alfa']

(-2.1392682708349096, -2.1392682708349096)

In [29]:
df4 = pd.DataFrame(np.arange(12.).reshape((3,4)), columns=list('abcd'))
df5 = pd.DataFrame(np.arange(20.).reshape(4,5), columns=list('abcde'))
df5.loc[1,'b']=np.nan
df4, df5, df4+df5

(     a    b     c     d
 0  0.0  1.0   2.0   3.0
 1  4.0  5.0   6.0   7.0
 2  8.0  9.0  10.0  11.0,
       a     b     c     d     e
 0   0.0   1.0   2.0   3.0   4.0
 1   5.0   NaN   7.0   8.0   9.0
 2  10.0  11.0  12.0  13.0  14.0
 3  15.0  16.0  17.0  18.0  19.0,
       a     b     c     d   e
 0   0.0   2.0   4.0   6.0 NaN
 1   9.0   NaN  13.0  15.0 NaN
 2  18.0  20.0  22.0  24.0 NaN
 3   NaN   NaN   NaN   NaN NaN)

In [30]:
df4, pd.DataFrame(np.arange(12.).reshape(3,4), columns=list('abcd'))

(     a    b     c     d
 0  0.0  1.0   2.0   3.0
 1  4.0  5.0   6.0   7.0
 2  8.0  9.0  10.0  11.0,
      a    b     c     d
 0  0.0  1.0   2.0   3.0
 1  4.0  5.0   6.0   7.0
 2  8.0  9.0  10.0  11.0)

In [31]:
df4.add(df5, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0